** Preparar para ejecutar slurm
#+NAME: slurm-setup
#+BEGIN_SRC sh :noweb yes :results output :exports none :tangle ../shell/slurm-setup.sh :dir /ssh:jdiaz@192.168.26.3:/home/jdiaz/
sbatch 
#+END_SRC
#+NAME: slurm-setup-test
#+BEGIN_SRC sh :noweb yes :results output :exports none :tangle ../shell/slurm-setup.sh :dir /ssh:jdiaz@192.168.26.3:/home/jdiaz/
#!/bin/bash
#SBATCH --job-name=jdiaz-test4​ #nombre para identificar el trabajo. Por defecto es el nombre ​​del ​​script
#SBATCH​​ --ntasks=1 # cantidad de cores pedidos
#SBATCH --tasks-per-node=1​ # cantidad de cores por nodo, para que distribuya entre varios nodos
#SBATCH --output=trabajo-%j-salida.txt​# la salida y errore standar van a este archivo. Si no es especificado es slurm-%j.out (donde​​%j​​es​​el​​Job​​ID)
#SBATCH --error=trabajo-%j-error.txt​#siseespecifica,lasalidadeerrorvaporseparadoaeste​​archivo#
#SBATCH --cpus-per-task=1 #por cada tarea solicita C cores,utilizando en total C*Ncores. Es útil paracódigo híbrido MPI+OpenMP:lanza N procesos MPI reservando C cores para cada una.
#SBATCH --ntasks-per-node= 1 #asigna a lo sumo TPN tareas por nodo hasta completar las ntasks, sin ocupar el resto de cores del nodo. Por ejemplo,siN=20yTPN=10seocuparán​​10​​cores​​en​​2​​nodos
#SBATCH --nodes=1 # solicita P nodos completos. Tener en cuenta lanzar la cantidad adecuada de procesos para que el nodo no quede subtulizado.
#SBATCH --mem-per-cpu=M​ # asigna M  megabytes de memoria por cada ntask. Si no se especifica, por defecto es 6440MB(aprox6.3GB). Tener en cuenta que la tarea será cancelada si excede la cantidad solicitada.
#SBATCH --output=trabajo-%j.salida.txt​​​#​​redirige la salida del script al archivo​​especificado.
#SBATCH --error=trabajo-%j.error.txt # redirige la salida de error del script al archivo especificado.
#SBATCH --mail-user=jdiaz@ingenieria.uner.edu.ar # envía un correo cuando el trabajo finaliza correctamente o por algún error
octave octave-test-code.m
#+END_SRC

#+RESULTS: slurm-setup
#+begin_example
GNU Octave, version 3.8.2
Copyright (C) 2014 John W. Eaton and others.
This is free software; see the source code for copying conditions.
There is ABSOLUTELY NO WARRANTY; not even for MERCHANTABILITY or
FITNESS FOR A PARTICULAR PURPOSE.  For details, type 'warranty'.

Octave was configured for "x86_64-redhat-linux-gnu".

Additional information about Octave is available at http://www.octave.org.

Please contribute if you find this software useful.
For more information, visit http://www.octave.org/get-involved.html

Read http://www.octave.org/bugs.html to learn how to submit bug reports.
For information about changes from previous versions, type 'news'.

Elapsed time is 6.25418 seconds.
#+end_example

#+NAME: octave-test-code
#+BEGIN_SRC octave :results output 
tic;
A=rand(6000);
B=rand(6000);
C=A*B;
toc
#+END_SRC

#+RESULTS: octave-test-code
: Elapsed time is 5.01487 seconds.

** Ejecutar scritp de octave :noexport:
   Para ejecutar un script octave sin que quede dependiendo de la terminal. Genera un archivo con la salida normal y otro en caso de error.
#+NAME: run-octave-instances
#+BEGIN_SRC sh :exports none :tangle ../shell/run-octave-instances.sh
#!/bin/sh -f
FILE=$1
OFILE=`echo $FILE | sed 's/.$//' | sed 's/.$//'`"-output.txt"
EFILE=`echo $FILE | sed 's/.$//' | sed 's/.$//'`"-error.txt"
echo "Running -> " $FILE
echo "Octave Output -> " $OFILE 
echo "Octave Error -> " $EFILE 
nohup octave -q $FILE > $OFILE 2> $EFILE &
echo "Command Started"
#+END_SRC

#+BEGIN_SRC octave :results output :exports none
  mat1=rand(2000);
  mat2=randn(2000);
  tic;mat3=mat1*mat2;toc
#+END_SRC

#+RESULTS:
: Elapsed time is 5.62615 seconds.
: 

** nextpow2n (nextpow2 vectorizado) en octave
#+NAME: nextpow2n
#+BEGIN_SRC octave :exports none :tangle ../octave/miscellaneous/nextpow2n.m
  function NEWV = nextpow2n(V)
    ## usage: NEWV = nextpow2n(V)
    ## This function is vectorized version of nextpow2n.
    if (isvector(V))
      L=length(V);
      NEWV=zeros(size(V));
      for j=1:L
        NEWV(j)=nextpow2(V(j));
      endfor
    endif
  endfunction
#+END_SRC

#+RESULTS: nextpow2n

#+NAME: nextpow2n-test
#+BEGIN_SRC octave :exports none :results output :exports none 
  addpath(genpath("../octave"))
  a=ones(3,2,2,5);
  size_a=size(a);
  nextpow2n(size_a)
#+END_SRC

#+RESULTS: nextpow2n-test
: ans =
: 
:    2   1   1   3
: 

** Newton-Raphson method :noexport:
#+NAME: nr_method
#+BEGIN_SRC octave :results none :exports none :tangle ../octave/miscellaneous/nr_method.m
  function [X iteration x_error] = nr_method(F,FPRIME,X0,TOL=10e-3,MAX_ITER=20)
      iteration=1;
      x_error=inf;
      XOLD=X0;
      while ((iteration<MAX_ITER)&&(x_error>TOL))
        X=XOLD-F(XOLD)/FPRIME(XOLD);
        x_error=abs(X-XOLD);
        XOLD=X;
        iteration+=1;
      endwhile
  endfunction
#+END_SRC

#+NAME: nr_method_test
#+BEGIN_SRC octave :exports none g:results output :exports none
  addpath(genpath("../octave"));
  fx=@(X)sin(X);
  fprime_theo=@(X)cos(X);
  fprime_num=@(X)dfx(fx,X,0);
  x_ini=2.8;
  tol=1e-3;
  format("long");
  pi
  [x iters err]= nr_method(fx,fprime_theo,x_ini,tol)
  [x iters err]= nr_method(fx,fprime_num,x_ini,tol)

#+END_SRC

#+RESULTS: nr_method_test
: ans =  3.14159265358979
: x =  3.14159265358979
: iters =  4
: err =    9.02478856978917e-07
: x =  3.14159265358994
: iters =  4
: err =    9.04813544533312e-07

